# GetDefaultHookOrientation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..GetDefaultHookOrientation Method
RebarShape Class See Also
---
Get the hook orientation.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public RebarHookOrientation GetDefaultHookOrientation(
	int index
)
```

Visual Basic
---
```text
Public Function GetDefaultHookOrientation ( _
	index As Integer _
) As RebarHookOrientation
```

Visual C++
---
```text
public:
RebarHookOrientation GetDefaultHookOrientation(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 0 for the starting hook, 1 for the ending hook.
# Remarks
Replaces the method GetHookOrientation() from prior releases.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | index must be 0 or 1. |

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace